# Задача 22:
# Даны два неупорядоченных набора целых чисел (может быть, с
#  повторениями). Выдать без повторений в порядке возрастания все те числа, которые
#  встречаются в обоих наборах.
#  Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
#  элементов второго множества. Затем пользователь вводит сами элементы множеств.
# 11 6
# 6 12
#  2 4 6 8 10 12 10 8 6 4 2
#  3 6 9 12 15 18

from random import randint # необходим модуль для функции рандомного заполнения
n1 = int(input('сколько чисел в вашем первом списке?: ')) # количество элементов в рандомном списке
m = int(input('сколько чисел в вашем втором списке?: ')) 
minRandBorder1 = int(input('какое минимальное значение элемента в диапазоне элементов вашего 1-ого рандомного списка чисел?: ')) # минимум диапазона значений в списке
maxRandBorder1 = int(input('какое максимальное значение элемента в диапазоне элементов вашего 1-ого рандомного списка чисел?: ')) # максимум диапазона значений в списке
minRandBorder2 = int(input('какое минимальное значение элемента в диапазоне элементов вашего 2-ого рандомного списка чисел?: ')) # минимум диапазона значений в списке
maxRandBorder2 = int(input('какое максимальное значение элемента в диапазоне элементов вашего 2-ого рандомного списка чисел?: ')) # максимум диапазона значений в списке
listOfDiffValue1 = [] # создаем список для автозаполнения
listOfDiffValue2 = [] # создаем список для автозаполнения

def autofill(amount, minBorder, maxBorder): # метод автозаполнения массива элементами: от min до max
    list_comprehension = [randint(minBorder,maxBorder) for i in range(abs(amount))] # взял по модулю на случай если клиент введёт значение < 0
    return list_comprehension

listOfDiffValue1 = autofill(n1, minRandBorder1, maxRandBorder1)
print(f'Ваш первый список: {listOfDiffValue1}')
listOfDiffValue2 = autofill(m, minRandBorder2, maxRandBorder2)
print(f'Ваш второй список: {listOfDiffValue2}')
print(f'Элементы которые есть в обоих списках это: {sorted(list((set(listOfDiffValue1)).intersection(set(listOfDiffValue2))))}')
