# Задача 8: Требуется определить, можно ли от шоколадки размером n ×mk
# долек отломить
# долек, если разрешается сделать один разлом по
# прямой между дольками (то есть разломить шоколадку на два
# прямоугольника).
# 3 2 4 -> yes 3 2 1 -> no

a = 3
b = 4
c = 8

size = a * b

if c <= size and (c % b == 0 or c % a == 0):
    print('success, yes')
else:
    print('no')