#Задача 2: Найдите сумму цифр трехзначного числа.
#123 -> 6 (1 + 2 + 3) 100 -> 1 (1 + 0 + 0)

n = int(input("Введите число больше 0: \n"))
res = 0

while n > 0:
    x = n % 10
    res = res + x
    n = n // 10
print(res)