# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы
# расплачивались за проезд и получали билет с номером. Счастливым
# билетом называют такой билет с шестизначным номером, где сумма
# первых трех цифр равна сумме последних трех. Т.е. билет с номером
# 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
# программу, которая проверяет счастливость билета
# .
#  385916 -> yes
# 123456 -> no
##решение циклом
# n = int(input("Введите шестизначное положительное число: \n"))
# sum1 = 0
# sum2 = 0

# if (n > 999999) and (n < 100000):
#     print('Вы ввели не шестизначное число, попробуйте снова.')
#     n = int(input('Введите шестизначное положительное число: \n'))
    
# else:
#     while n > 0:
#         if n > 999:
#             sum1 += n%10
#         else:
#             sum2 += n%10
#         n //= 10

#     if sum1 == sum2:
#         print('ticket is happy')
#     else:
#         print('the luck has turned away from u')
## решение строкой
n = (input("Введите шестизначное положительное число: \n"))

if int(n) > 999999:
    print('Вы ввели больше 6 знаков в числе, попробуйте снова.')
    n = (input('Введите шестизначное положительное число: \n'))
elif int(n) < 100000:      
    print('Вы ввели меньше 6 знаков в числе, попробуйте снова.')
    n = (input('Введите шестизначное положительное число: \n'))
else:
    l = int(n[0]) + int(n[1]) + int(n[2])
    r = int(n[-1]) + int(n[-2]) + int(n[-3])
    if l == r:
        print('ticket is happy')
    else:
        print('the luck has turned away from u')