# Задача 16: Требуется вычислить, сколько раз встречается некоторое
#   число X в массиве A[1..N].
# Пользователь в первой строке вводит
#  натуральное число N – количество элементов в массиве. В последующих
#   строках записаны N целых чисел Ai
# . Последняя строка содержит число X
# 5
# 1234 5
# 3
# -> 1

from random import randint # необходим модуль для функции рандомного заполнения
x = int(input('сколько чисел в вашем списке?: ')) # количество элементов в рандомном списке
minRandBorder = int(input('какое минимальное значение элемента в диапазоне элементов вашего рандомного списка чисел?: ')) # минимум диапазона значений в списке
maxRandBorder = int(input('какое максимальное значение элемента в диапазоне элементов вашего рандомного списка чисел?: ')) # максимум диапазона значений в списке
n = int(input('элементы с каким значением считаем?: '))
listOfDiffValue = [] # создаем список для автозаполнения

def autofill(amount, minBorder, maxBorder): # метод автозаполнения массива элементами: от min до max
    list_comprehension = [randint(minBorder,maxBorder) for i in range(abs(amount))] # взял по модулю на случай если клиент введёт значение < 0
    return list_comprehension

listOfDiffValue = autofill(x, minRandBorder, maxRandBorder)
print(f'Ваш изначальный список: {listOfDiffValue}')

print(f'В списке встречается {listOfDiffValue.count(n)} таких элементов')